#+title: Advent of Code 2022

* Description
Solving AOC 2022 using rust
https://adventofcode.com/2022

* How to run

#+begin_src bash
    cargo test
#+end_src

#+RESULTS:
|         |             |      |    |         |   |         |   |          |   |           |   |          |      |          |    |       |
| running | 1           | test |    |         |   |         |   |          |   |           |   |          |      |          |    |       |
| test    | tests::day1 | ...  | ok |         |   |         |   |          |   |           |   |          |      |          |    |       |
|         |             |      |    |         |   |         |   |          |   |           |   |          |      |          |    |       |
| test    | result:     | ok.  |  1 | passed; | 0 | failed; | 0 | ignored; | 0 | measured; | 0 | filtered | out; | finished | in | 0.00s |
|         |             |      |    |         |   |         |   |          |   |           |   |          |      |          |    |       |
